---
type: FailureMessageKey
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# FailureMessageKey

`Autodesk.Revit.DB.FailureMessageKey` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FailureMessageKey | 2011 | `public FailureMessageKey ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Equals | — | `public override bool Equals ( Object obj )` |
| Method | GetHashCode | — | `public override int GetHashCode ()` |
| Method | IsEqual | 2011 | `public bool IsEqual ( FailureMessageKey other )` |
| Method | IsValid | 2011 | `public bool IsValid ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |